Repository: WPPlugins/locationews
Catalog: languages/locationews-*.po
Languages: fi

source: Search location
fi: Etsi sijaintia

source: Locationews Default Category
fi: Locationews Oletuskategoria

source: Set the default category for Locationews articles. This function does not affect on the WordPress categories.
fi: Aseta oletuskategoria kirjoittamillesi Locationews-uutisille. Ei vaikuta WordPressin omiin kategorioihin.

source: Categories
fi: Kategoriat

source: Select WordPress Categories whose news you want to post to Locationews.
fi: Valitse ne WordPressin kategoriat, joiden uutiset haluat Locationewsiin.

source: Post types
fi: Postityypit

source: Choose which post types you want to allow use Locationews. The default option is normal post type.
fi: Valitse millaiset julkaisut haluat Locationewsiin. Lähtökohtaisesti julkaistaan post-julkaisut.

source: Default location
fi: Oletussijainti

source: Select the default location (the default option is your publication's address, here you can choose another location).
fi: Valitse julkaisujesi oletussijainti (oletussijainti on lähtökohtaisesti toimituksesi osoitteessa, tästä voit valita toisen sijainnin).

source: Settings
fi: Asetukset

source: Locationews plugin publish your news to Locationews service. With these settings, you can specify the basic functions on the map selector which appear in the article edit view.
fi: Locationews-plugin julkaisee uutisesi Locationews palveluun. Näillä asetuksilla voit määrittää artikkelinäkymään ilmestyvän karttavalitsimen perustoiminnot.

source: All
fi: Kaikki

source: When Locationews is enabled, the article will be automatically added to Locationews when you press the Publish. If you would like to take published article out of Locationews, change to Off and update the article.
fi: Kun Locationews on käytössä, artikkeli lisätään automaattisesti Locationewsiin painaessasi ‘Julkaise’. Jos haluat julkaistun artikkelin pois Locationewsistä, vaihda valinnaksi ‘Off’ ja päivitä artikkeli.

source: Locationews enabled
fi: Locationews käytössä

source: Enable Ads
fi: Salli mainokset

source: Ads
fi: Mainokset

source: Enable show more
fi: Salli näytä lisää

source: Show more
fi: Näytä lisää

source: Select a Locationews category for the news. This function does not affect to the WordPress categories.
fi: Valitse Locationewsin kategoria uutisellesi. Tämä toiminto ei vaikuta WordPressin kategoriohin.

source: Category
fi: Kategoria

source: Write here your article's coordinates.
fi: Kirjoita tähän uutisesi koordinaatit.

source: Coordinates
fi: Koordinaatit

source: Show control panel
fi: Näytä ohjauspaneeli

source: View in Locationews Desctop Applcation
fi: Näytä Locationews Desktopissa

source: Add your news location on the map by dragging the marker or double clicking on the map. You can also search location by address.
fi: Lisää uutisesi tapahtumapaikka tuplaklikkaamalla uutisen sijaintia kartalla. Voit myös hakea sijaintia osoitteella.

source: Register your free account at <a href="https://locationews.com/en/" target="_blank">Locationews.com</a> and start publishing.
fi: Rekisteröi ilmainen tili osoitteessa <a href=“https://locationews.com” target=“_blank”>Locationews.com</a> ja ala julkaisemaan.

source: Missing required fields
fi: Pakollisia kenttiä puuttuu

source: Save Settings
fi: Tallenna asetukset

source: cURL library is required. Can't use the plugin without it.
fi: cURL kirjasto on pakollinen. Liitännäistä ei voi käyttää ilman sitä.

source: Can't read required settings
fi: Pakollisia asetuksia ei pystytä lukemaan

source: Required settings are invalid
fi: Pakolliset asetukset ovat virheellisiä

source: Post successfully added
fi: Artikkeli onnistuneesti lisätty

source: Post successfully updated
fi: Artikkeli onnistuneesti päivitetty

source: Post deleted from Locationews
fi: Artikkeli poistettu Locationewsista

source: Post successfully added. <strong>Note that this is just a testing enviroment. Your article was not really posted to Locationews API.</strong> Register your free account at <a href="https://locationews.com/en/" target="_blank">Locationews.com</a>
fi: Post successfully added. <strong>Note that this is just a testing enviroment. Your article was not really posted to Locationews API.</strong> Register your free account at <a href=“https://locationews.com” target=“_blank”>Locationews.com</a>

source: Post successfully updated. <strong>Note that this is just a testing enviroment. Your article was not really posted to Locationews API.</strong> Register your free account at <a href="https://locationews.com/en/" target="_blank">Locationews.com</a>
fi: Post successfully updated. <strong>Note that this is just a testing enviroment. Your article was not really posted to Locationews API.</strong> Register your free account at <a href=“https://locationews.com” target=“_blank”>Locationews.com</a>

source: Post deleted from Locationews. <strong>Note that this is just a testing enviroment. Your article was not really posted to Locationews API.</strong> Register your free account at <a href="https://locationews.com/en/" target="_blank">Locationews.com</a>
fi: Post deleted from Locationews. <strong>Note that this is just a testing enviroment. Your article was not really posted to Locationews API.</strong> Register your free account at <a href=“https://locationews.com” target=“_blank”>Locationews.com</a>

source: General error
fi: Yleinen virhe

source: Invalid URL or request method
fi: Virheellinen URL tai metodi

source: No Authorization header
fi: Ei autentikointiheaderiä

source: JWT error
fi: JWT virhe

source: Missing required parameter
fi: Pakollinen parametri puuttuu

source: Forbidden parameter
fi: Kielletty parametri

source: Invalid value for parameter
fi: Virheellinen arvo parametrille

source: Insufficient privileges to perform action
fi: Virheelliset käyttöoikeudet

source: No news id
fi: Ei uutisen id:tä

source: No user id
fi: Ei käyttäjän id:tä

source: User not found
fi: Käyttäjää ei löydy

source: Error uploading image
fi: Virhe ladattaessa kuvaa

source: Unable to delete file since the file does not exist
fi: Tiedostoa ei voida poistaa koska sitä ei ole olemassa

source: Image file not deleted since it does not belong to this news
fi: Kuvaa ei poistettu koska se ei kuulu tähän uutiseen

source: Saving news data failed
fi: Uutisdatan tallennus epäonnistui

source: No publication id
fi: Ei julkaisun id:tä

source: Publication not found
fi: Julkaisua ei löydy

source: Error processing image
fi: Virhe käsitellessä kuvaa

source: Error resizing image
fi: Virhe kuvakoon muuttamisessa

source: Error saving resized image
fi: Virhe tallennettaessa muutettua kuvaa

source: Error saving image thumbnail
fi: Virhe tallennettaessa pientä kuvaa

source: Error copying image, file not found
fi: Virhe kopioidessa kuvaa, tiedostoa ei lödy
